; domain
(define (domain transport-strips)
(:requirements :typing :action-costs)

(:types location fuellevel locatable - object 
	package truck - locatable
)

(:predicates 
(connected ?l1 ?l2 - location)
(at ?o - locatable ?l - location)
(in ?p - package ?t - truck)
(fuel ?t - truck ?level - fuellevel)
(fuelcost ?level - fuellevel ?l1 ?l2 - location)
(sum ?a ?b ?c - fuellevel)
)

(:functions 
(total-cost) - number)

(:action LOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (at ?p ?l))
:effect
(and (not (at ?p ?l)) (in ?p ?t) (increase (total-cost) 1))
)

(:action UNLOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (in ?p ?t))
:effect
(and (at ?p ?l) (not (in ?p ?t)) (increase (total-cost) 1))
)

(:action DRIVE
:parameters
(?t - truck
?l1 - location
?l2 - location
?fuelpost - fuellevel
?fueldelta - fuellevel
?fuelpre - fuellevel)
:precondition
(and 
(connected ?l1 ?l2)
(fuelcost ?fueldelta ?l1 ?l2)
(fuel ?t ?fuelpre)
(sum ?fuelpost ?fueldelta ?fuelpre)
(at ?t ?l1)
)
:effect
(and (not (at ?t ?l1)) 
     (at ?t ?l2) 
     (not (fuel ?t ?fuelpre)) 
     (fuel ?t ?fuelpost)
     (increase (total-cost) 1))
)

)

; problem
(define (problem transport-l4-t1-p15---int100n150-m25---int100c150---s371---e0)
(:domain transport-strips)

(:objects
l0 l1 l2 l3 - location
t0 - truck
p0 p1 p2 p3 p4 p5 p6 p7 p8 p9 p10 p11 p12 p13 p14 - package
level0 level1 level2 level3 level4 level5 level6 level7 level8 level9 level10 level11 level12 level13 level14 level15 level16 level17 level18 level19 level20 level21 level22 level23 level24 level25 level26 level27 level28 level29 level30 level31 level32 level33 level34 level35 level36 level37 level38 level39 level40 level41 level42 level43 level44 level45 level46 level47 level48 level49 level50 level51 - fuellevel
)

(:init
(sum level0 level4 level4)
(sum level0 level5 level5)
(sum level0 level6 level6)
(sum level0 level10 level10)
(sum level0 level15 level15)
(sum level0 level16 level16)
(sum level1 level4 level5)
(sum level1 level5 level6)
(sum level1 level6 level7)
(sum level1 level10 level11)
(sum level1 level15 level16)
(sum level1 level16 level17)
(sum level2 level4 level6)
(sum level2 level5 level7)
(sum level2 level6 level8)
(sum level2 level10 level12)
(sum level2 level15 level17)
(sum level2 level16 level18)
(sum level3 level4 level7)
(sum level3 level5 level8)
(sum level3 level6 level9)
(sum level3 level10 level13)
(sum level3 level15 level18)
(sum level3 level16 level19)
(sum level4 level4 level8)
(sum level4 level5 level9)
(sum level4 level6 level10)
(sum level4 level10 level14)
(sum level4 level15 level19)
(sum level4 level16 level20)
(sum level5 level4 level9)
(sum level5 level5 level10)
(sum level5 level6 level11)
(sum level5 level10 level15)
(sum level5 level15 level20)
(sum level5 level16 level21)
(sum level6 level4 level10)
(sum level6 level5 level11)
(sum level6 level6 level12)
(sum level6 level10 level16)
(sum level6 level15 level21)
(sum level6 level16 level22)
(sum level7 level4 level11)
(sum level7 level5 level12)
(sum level7 level6 level13)
(sum level7 level10 level17)
(sum level7 level15 level22)
(sum level7 level16 level23)
(sum level8 level4 level12)
(sum level8 level5 level13)
(sum level8 level6 level14)
(sum level8 level10 level18)
(sum level8 level15 level23)
(sum level8 level16 level24)
(sum level9 level4 level13)
(sum level9 level5 level14)
(sum level9 level6 level15)
(sum level9 level10 level19)
(sum level9 level15 level24)
(sum level9 level16 level25)
(sum level10 level4 level14)
(sum level10 level5 level15)
(sum level10 level6 level16)
(sum level10 level10 level20)
(sum level10 level15 level25)
(sum level10 level16 level26)
(sum level11 level4 level15)
(sum level11 level5 level16)
(sum level11 level6 level17)
(sum level11 level10 level21)
(sum level11 level15 level26)
(sum level11 level16 level27)
(sum level12 level4 level16)
(sum level12 level5 level17)
(sum level12 level6 level18)
(sum level12 level10 level22)
(sum level12 level15 level27)
(sum level12 level16 level28)
(sum level13 level4 level17)
(sum level13 level5 level18)
(sum level13 level6 level19)
(sum level13 level10 level23)
(sum level13 level15 level28)
(sum level13 level16 level29)
(sum level14 level4 level18)
(sum level14 level5 level19)
(sum level14 level6 level20)
(sum level14 level10 level24)
(sum level14 level15 level29)
(sum level14 level16 level30)
(sum level15 level4 level19)
(sum level15 level5 level20)
(sum level15 level6 level21)
(sum level15 level10 level25)
(sum level15 level15 level30)
(sum level15 level16 level31)
(sum level16 level4 level20)
(sum level16 level5 level21)
(sum level16 level6 level22)
(sum level16 level10 level26)
(sum level16 level15 level31)
(sum level16 level16 level32)
(sum level17 level4 level21)
(sum level17 level5 level22)
(sum level17 level6 level23)
(sum level17 level10 level27)
(sum level17 level15 level32)
(sum level17 level16 level33)
(sum level18 level4 level22)
(sum level18 level5 level23)
(sum level18 level6 level24)
(sum level18 level10 level28)
(sum level18 level15 level33)
(sum level18 level16 level34)
(sum level19 level4 level23)
(sum level19 level5 level24)
(sum level19 level6 level25)
(sum level19 level10 level29)
(sum level19 level15 level34)
(sum level19 level16 level35)
(sum level20 level4 level24)
(sum level20 level5 level25)
(sum level20 level6 level26)
(sum level20 level10 level30)
(sum level20 level15 level35)
(sum level20 level16 level36)
(sum level21 level4 level25)
(sum level21 level5 level26)
(sum level21 level6 level27)
(sum level21 level10 level31)
(sum level21 level15 level36)
(sum level21 level16 level37)
(sum level22 level4 level26)
(sum level22 level5 level27)
(sum level22 level6 level28)
(sum level22 level10 level32)
(sum level22 level15 level37)
(sum level22 level16 level38)
(sum level23 level4 level27)
(sum level23 level5 level28)
(sum level23 level6 level29)
(sum level23 level10 level33)
(sum level23 level15 level38)
(sum level23 level16 level39)
(sum level24 level4 level28)
(sum level24 level5 level29)
(sum level24 level6 level30)
(sum level24 level10 level34)
(sum level24 level15 level39)
(sum level24 level16 level40)
(sum level25 level4 level29)
(sum level25 level5 level30)
(sum level25 level6 level31)
(sum level25 level10 level35)
(sum level25 level15 level40)
(sum level25 level16 level41)
(sum level26 level4 level30)
(sum level26 level5 level31)
(sum level26 level6 level32)
(sum level26 level10 level36)
(sum level26 level15 level41)
(sum level26 level16 level42)
(sum level27 level4 level31)
(sum level27 level5 level32)
(sum level27 level6 level33)
(sum level27 level10 level37)
(sum level27 level15 level42)
(sum level27 level16 level43)
(sum level28 level4 level32)
(sum level28 level5 level33)
(sum level28 level6 level34)
(sum level28 level10 level38)
(sum level28 level15 level43)
(sum level28 level16 level44)
(sum level29 level4 level33)
(sum level29 level5 level34)
(sum level29 level6 level35)
(sum level29 level10 level39)
(sum level29 level15 level44)
(sum level29 level16 level45)
(sum level30 level4 level34)
(sum level30 level5 level35)
(sum level30 level6 level36)
(sum level30 level10 level40)
(sum level30 level15 level45)
(sum level30 level16 level46)
(sum level31 level4 level35)
(sum level31 level5 level36)
(sum level31 level6 level37)
(sum level31 level10 level41)
(sum level31 level15 level46)
(sum level31 level16 level47)
(sum level32 level4 level36)
(sum level32 level5 level37)
(sum level32 level6 level38)
(sum level32 level10 level42)
(sum level32 level15 level47)
(sum level32 level16 level48)
(sum level33 level4 level37)
(sum level33 level5 level38)
(sum level33 level6 level39)
(sum level33 level10 level43)
(sum level33 level15 level48)
(sum level33 level16 level49)
(sum level34 level4 level38)
(sum level34 level5 level39)
(sum level34 level6 level40)
(sum level34 level10 level44)
(sum level34 level15 level49)
(sum level34 level16 level50)
(sum level35 level4 level39)
(sum level35 level5 level40)
(sum level35 level6 level41)
(sum level35 level10 level45)
(sum level35 level15 level50)
(sum level35 level16 level51)
(sum level36 level4 level40)
(sum level36 level5 level41)
(sum level36 level6 level42)
(sum level36 level10 level46)
(sum level36 level15 level51)
(sum level37 level4 level41)
(sum level37 level5 level42)
(sum level37 level6 level43)
(sum level37 level10 level47)
(sum level38 level4 level42)
(sum level38 level5 level43)
(sum level38 level6 level44)
(sum level38 level10 level48)
(sum level39 level4 level43)
(sum level39 level5 level44)
(sum level39 level6 level45)
(sum level39 level10 level49)
(sum level40 level4 level44)
(sum level40 level5 level45)
(sum level40 level6 level46)
(sum level40 level10 level50)
(sum level41 level4 level45)
(sum level41 level5 level46)
(sum level41 level6 level47)
(sum level41 level10 level51)
(sum level42 level4 level46)
(sum level42 level5 level47)
(sum level42 level6 level48)
(sum level43 level4 level47)
(sum level43 level5 level48)
(sum level43 level6 level49)
(sum level44 level4 level48)
(sum level44 level5 level49)
(sum level44 level6 level50)
(sum level45 level4 level49)
(sum level45 level5 level50)
(sum level45 level6 level51)
(sum level46 level4 level50)
(sum level46 level5 level51)
(sum level47 level4 level51)

(connected l0 l1)
(fuelcost level10 l0 l1)
(connected l0 l2)
(fuelcost level16 l0 l2)
(connected l0 l3)
(fuelcost level5 l0 l3)
(connected l1 l0)
(fuelcost level10 l1 l0)
(connected l1 l2)
(fuelcost level15 l1 l2)
(connected l1 l3)
(fuelcost level4 l1 l3)
(connected l2 l0)
(fuelcost level16 l2 l0)
(connected l2 l1)
(fuelcost level15 l2 l1)
(connected l2 l3)
(fuelcost level6 l2 l3)
(connected l3 l0)
(fuelcost level5 l3 l0)
(connected l3 l1)
(fuelcost level4 l3 l1)
(connected l3 l2)
(fuelcost level6 l3 l2)

(at t0 l3)
(fuel t0 level51)
(= (total-cost) 0)

(at p0 l3)
(at p1 l0)
(at p2 l2)
(at p3 l2)
(at p4 l3)
(at p5 l2)
(at p6 l0)
(at p7 l1)
(at p8 l3)
(at p9 l1)
(at p10 l3)
(at p11 l3)
(at p12 l3)
(at p13 l0)
(at p14 l1)
)

(:goal
(and
(at p0 l2)
(at p1 l3)
(at p2 l1)
(at p3 l0)
(at p4 l1)
(at p5 l3)
(at p6 l1)
(at p7 l2)
(at p8 l2)
(at p9 l2)
(at p10 l0)
(at p11 l2)
(at p12 l2)
(at p13 l3)
(at p14 l2)
)
)
(:metric minimize (total-cost)))

; plan
1. (load p8 t0 l3)
   deleted: (at p8 l3)
   added: (in p8 t0)
   goals met: 0 of 15
2. (load p4 t0 l3)
   deleted: (at p4 l3)
   added: (in p4 t0)
   goals met: 0 of 15
3. (load p12 t0 l3)
   deleted: (at p12 l3)
   added: (in p12 t0)
   goals met: 0 of 15
4. (load p11 t0 l3)
   deleted: (at p11 l3)
   added: (in p11 t0)
   goals met: 0 of 15
5. (load p10 t0 l3)
   deleted: (at p10 l3)
   added: (in p10 t0)
   goals met: 0 of 15
6. (load p0 t0 l3)
   deleted: (at p0 l3)
   added: (in p0 t0)
   goals met: 0 of 15
7. (drive t0 l3 l2 level45 level6 level51)
   deleted: (at t0 l3) (fuel t0 level51)
   added: (at t0 l2) (fuel t0 level45)
   goals met: 0 of 15
8. (unload p8 t0 l2)
   deleted: (in p8 t0)
   added: (at p8 l2)
   goals met: 1 of 15
9. (unload p12 t0 l2)
   deleted: (in p12 t0)
   added: (at p12 l2)
   goals met: 2 of 15
10. (unload p11 t0 l2)
   deleted: (in p11 t0)
   added: (at p11 l2)
   goals met: 3 of 15
11. (unload p0 t0 l2)
   deleted: (in p0 t0)
   added: (at p0 l2)
   goals met: 4 of 15
12. (load p5 t0 l2)
   deleted: (at p5 l2)
   added: (in p5 t0)
   goals met: 4 of 15
13. (load p3 t0 l2)
   deleted: (at p3 l2)
   added: (in p3 t0)
   goals met: 4 of 15
14. (load p2 t0 l2)
   deleted: (at p2 l2)
   added: (in p2 t0)
   goals met: 4 of 15
15. (drive t0 l2 l0 level29 level16 level45)
   deleted: (at t0 l2) (fuel t0 level45)
   added: (at t0 l0) (fuel t0 level29)
   goals met: 4 of 15
16. (unload p3 t0 l0)
   deleted: (in p3 t0)
   added: (at p3 l0)
   goals met: 5 of 15
17. (unload p10 t0 l0)
   deleted: (in p10 t0)
   added: (at p10 l0)
   goals met: 6 of 15
18. (load p6 t0 l0)
   deleted: (at p6 l0)
   added: (in p6 t0)
   goals met: 6 of 15
19. (load p13 t0 l0)
   deleted: (at p13 l0)
   added: (in p13 t0)
   goals met: 6 of 15
20. (load p1 t0 l0)
   deleted: (at p1 l0)
   added: (in p1 t0)
   goals met: 6 of 15
21. (drive t0 l0 l1 level19 level10 level29)
   deleted: (at t0 l0) (fuel t0 level29)
   added: (at t0 l1) (fuel t0 level19)
   goals met: 6 of 15
22. (load p14 t0 l1)
   deleted: (at p14 l1)
   added: (in p14 t0)
   goals met: 6 of 15
23. (load p7 t0 l1)
   deleted: (at p7 l1)
   added: (in p7 t0)
   goals met: 6 of 15
24. (load p9 t0 l1)
   deleted: (at p9 l1)
   added: (in p9 t0)
   goals met: 6 of 15
25. (unload p2 t0 l1)
   deleted: (in p2 t0)
   added: (at p2 l1)
   goals met: 7 of 15
26. (unload p4 t0 l1)
   deleted: (in p4 t0)
   added: (at p4 l1)
   goals met: 8 of 15
27. (unload p6 t0 l1)
   deleted: (in p6 t0)
   added: (at p6 l1)
   goals met: 9 of 15
28. (drive t0 l1 l3 level15 level4 level19)
   deleted: (at t0 l1) (fuel t0 level19)
   added: (at t0 l3) (fuel t0 level15)
   goals met: 9 of 15
29. (unload p1 t0 l3)
   deleted: (in p1 t0)
   added: (at p1 l3)
   goals met: 10 of 15
30. (unload p13 t0 l3)
   deleted: (in p13 t0)
   added: (at p13 l3)
   goals met: 11 of 15
31. (unload p5 t0 l3)
   deleted: (in p5 t0)
   added: (at p5 l3)
   goals met: 12 of 15
32. (drive t0 l3 l2 level9 level6 level15)
   deleted: (at t0 l3) (fuel t0 level15)
   added: (at t0 l2) (fuel t0 level9)
   goals met: 12 of 15
33. (unload p14 t0 l2)
   deleted: (in p14 t0)
   added: (at p14 l2)
   goals met: 13 of 15
34. (unload p7 t0 l2)
   deleted: (in p7 t0)
   added: (at p7 l2)
   goals met: 14 of 15
35. (unload p9 t0 l2)
   deleted: (in p9 t0)
   added: (at p9 l2)
   goals met: 15 of 15
